-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: register
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `company_department`
--

DROP TABLE IF EXISTS `company_department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `company_department` (
  `company` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `department` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`company`,`department`),
  KEY `company` (`company`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `company_department`
--

LOCK TABLES `company_department` WRITE;
/*!40000 ALTER TABLE `company_department` DISABLE KEYS */;
INSERT INTO `company_department` VALUES (' 江西销售公司','成品油销售'),('上海销售公司','成品油销售'),('东北化工销售公司','炼化'),('东北炼化工程有限公司','工程建设'),('东北销售公司','成品油销售'),('东南亚管道有限公司','海外'),('中东公司','海外'),('中亚天然气管道有限公司','海外'),('中国华油集团公司 ','科研及其他单位'),('中国船舶燃料有限责任公司 ','科研及其他单位'),('中心医院 ','科研及其他单位'),('中意人寿保险有限公司','金融企业'),('中意财产保险有限公司','金融企业'),('中油财务有限责任公司 ','金融企业'),('中石油专属财产保险股份有限公司','金融企业'),('中石油煤层气有限责任公司','油气田'),('乌鲁木齐石化公司','炼化'),('云南石化有限公司','炼化'),('云南销售公司','成品油销售'),('企业学会 ','科研及其他单位'),('休斯敦技术研究中心','科研及其他单位'),('俄罗斯公司','海外'),('信息技术服务中心','科研及其他单位'),('克拉玛依石化有限责任公司','炼化'),('兰州石化公司','炼化'),('冀东油田公司','油气田'),('内蒙古销售公司','成品油销售'),('勘探开发研究院','科研及其他单位'),('勘探院数据中心','数据中心'),('北京天然气管道有限公司','管道'),('北京油气调控中心','管道'),('北京石油管理干院学院','科研及其他单位'),('北京销售公司','成品油销售'),('华东化工销售公司','炼化'),('华北化工销售公司','炼化'),('华北天然气销售公司','天然气销售'),('华北油田公司','油气田'),('华北石化公司','炼化'),('华南化工销售公司','炼化'),('南方石油勘探开发有限责任公司','油气田'),('吉林数据中心','数据中心'),('吉林油田公司','油气田'),('吉林石化公司','炼化'),('吉林销售公司','成品油销售'),('吐哈油田公司','油气田'),('呼和浩特石化公司','炼化'),('咨询中心','科研及其他单位'),('哈尔滨石化公司','炼化'),('哈萨克斯坦公司','海外'),('四川石化有限责任公司','炼化'),('四川销售公司','成品油销售'),('国际事业有限公司','海外'),('塔里木油田公司','油气田'),('大庆油田有限责任公司','油气田'),('大庆炼化公司','炼化'),('大庆石化公司','炼化'),('大港油田公司','油气田'),('大港石化公司','炼化'),('大连海运公司','成品油销售'),('大连石化公司','炼化'),('大连西太平洋石油化工公司','炼化'),('天津销售公司','成品油销售'),('天然气管道局','工程建设'),('天然气运输公司 ','金融企业'),('宁夏石化公司','炼化'),('宁夏销售公司','成品油销售'),('安全环保技术研究院','科研及其他单位'),('安徽销售公司','成品油销售'),('宝石石油机械有限责任公司','装备制造'),('宝鸡石油钢管有限责任公司','装备制造'),('审计服务中心','科研及其他单位'),('寰球工程公司','工程建设'),('对外合作经理部','油气田'),('尼罗河公司','海外'),('山东销售公司','成品油销售'),('山西销售公司','成品油销售'),('川庆钻探工程公司','工程技术服务'),('工程建设公司','工程建设'),('工程设计有限责任公司','工程建设'),('广东石化公司','炼化'),('广东销售公司','成品油销售'),('广州培训中心','科研及其他单位'),('广西石化公司','炼化'),('广西销售公司','成品油销售'),('庆阳石化公司','炼化'),('微软','科技部'),('技术开发公司','装备制造'),('抚顺石化公司','炼化'),('报社','科研及其他单位'),('拉美公司','海外'),('教育学会 ','科研及其他单位'),('文艺艺术工作者联合会','科研及其他单位'),('新疆油田公司','油气田'),('新疆销售公司','成品油销售'),('昆仑保险经纪股份有限公司','金融企业'),('昆仑信托有限责任公司（中油资产管理有限公司）','金融企业'),('昆仑工程公司','工程建设'),('昆仑燃气有限公司','天然气销售'),('昆仑能源有限公司','天然气销售'),('昆仑金融租赁有限责任公司','金融企业'),('昆仑银行股份有限公司 ','金融企业'),('昌平数据中心','数据中心'),('机关服务中心（北京华油服务总公司）','科研及其他单位'),('江苏销售公司','成品油销售'),('河北销售公司','成品油销售'),('河南销售公司','成品油销售'),('测井有限公司','工程技术服务'),('浙江油田公司','油气田'),('浙江销售公司','成品油销售'),('海南销售公司','成品油销售'),('海洋工程有限公司','工程技术服务'),('润滑油公司','成品油销售'),('渤海石油装备制造有限公司','装备制造'),('渤海钻探工程有限公司','工程技术服务'),('湖北销售公司','成品油销售'),('湖南销售公司','成品油销售'),('燃料油有限责任公司','成品油销售'),('物资公司（物资采购中心、招标中心）','科研及其他单位'),('独山子石化公司','炼化'),('玉门油田公司','油气田'),('甘肃销售公司','成品油销售'),('石油化工研究院','科研及其他单位'),('石油工业出版社','科研及其他单位'),('石油管工程技术研究院','科研及其他单位'),('福建销售公司','成品油销售'),('管道公司','管道'),('管道建设项目经理部','管道'),('经济技术研究院','科研及其他单位'),('西北化工销售公司','炼化'),('西北销售公司','成品油销售'),('西南化工销售公司','炼化'),('西南油气田公司','油气田'),('西南管道公司','管道'),('西气东输管道公司','管道'),('西藏销售公司','成品油销售'),('西部管道公司','管道'),('西部钻探工程有限公司','工程技术服务'),('规划总院','科研及其他单位'),('贵州销售公司','成品油销售'),('辽宁销售公司','成品油销售'),('辽河油田公司','油气田'),('辽河石化公司','炼化'),('辽阳石化公司','炼化'),('重庆销售公司','成品油销售'),('锦州石化公司','炼化'),('锦西石化公司','炼化'),('长城钻探工程公司','工程技术服务'),('长庆油田公司','油气田'),('长庆石化公司','炼化'),('阿姆河天然气公司','海外'),('陕西销售公司','成品油销售'),('集团东方地球物探勘探有限责任公司','工程技术服务'),('集团公司总部','总部机关'),('集团济柴动力总厂','装备制造'),('集团钻井工程技术研究院','科研及其他单位'),('青海油田公司','油气田'),('青海销售公司','成品油销售'),('黑龙江销售公司','成品油销售');
/*!40000 ALTER TABLE `company_department` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-01-28 15:20:05
